In [89]:
import pandas as pd

In [90]:
DF1 = pd.DataFrame({'Nombre':['Jose','Max'],'Carrera':['Arquitectura','Economía'],'Edad':[23,26]})
DF1

  Nombre       Carrera  Edad
0   Jose  Arquitectura    23
1    Max      Economía    26

In [91]:
DF2 = pd.DataFrame({'Nombre':['Aurora','Maria'],'Carrera':['Medicina','Informática'],'Edad':[22,28]})

# Concatenar dataframes.

In [92]:
DF3 = pd.concat([DF1,DF2],ignore_index=True)
DF3

   Nombre       Carrera  Edad
0    Jose  Arquitectura    23
1     Max      Economía    26
2  Aurora      Medicina    22
3   Maria   Informática    28

# Concatenar por columnas.

In [93]:
DF4 = pd.DataFrame({'Autos':['Nissan','Ford','Audi'], 'Color':['Blanco','Azul','Rojo']}).set_index('Autos')
DF5 = pd.DataFrame({'Autos':['Toyota','Ford','Audi'], 'Modelo':['2018','2017','2016']}).set_index('Autos')

In [94]:
#Deben tener la misma cantidad de filas.
DF6 = pd.concat([DF4,DF5],axis = 1)
DF6 = DF6.reset_index()
DF6

    Autos   Color Modelo
0  Nissan  Blanco    NaN
1    Ford    Azul   2017
2    Audi    Rojo   2016
3  Toyota     NaN   2018

# Mezclar dataframes

In [100]:
#how: inner(incluye solo las filas que coinciden con ambos df), outer(incluye todas las filas), left(incluye solo las filas de la izq), right(incluye las filas del df derecho  )
DF = pd.merge(DF4,DF5, on="Autos", how='inner')
DF

      Color Modelo
Autos
Ford   Azul   2017
Audi   Rojo   2016